In [3]:
#Langkah 0 - Load Library
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

In [4]:
#Langkah - Load Data
dpath = 'data/Titanic-Dataset-fixed.csv' #mendefinisikan yang berisi path/lokasi file csv yg ingin dibaca
df = pd.read_csv(dpath) #untuk membaca file CSV yang terletak di path yang telah didefinisikan sebelumnya
df.head() # membaca file CSV dan memuat datanya ke dalam DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,DECK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,DECK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,DECK,S

In [5]:
#Langkah 2 - Slice Data
df = df[['Survived', 'Pclass', 'Age', 'Sex', 'Cabin']] 3aris ini memilih kolom-kolom 'Survived', 'Pclass', 'Age', 'Sex', dan 'Cabin' dari DataFrame df. Ini menghasilkan DataFrame baru yang hanya berisi kolom-kolom ini.
df.head() #menampilkan kelima data yang sudah difilter

   Survived  Pclass   Age     Sex Cabin
0         0       3  22.0    male  DECK
1         1       1  38.0  female   C85
2         1       3  26.0  female  DECK
3         1       1  35.0  female  C123
4         0       3  35.0    male  DECK

In [6]:
#Langkah 3 - Encoding
le = LabelEncoder() # membuat objek dari LabelEncoder
df['Sex'] = le.fit_transform(df['Sex']) # proses encoding
df['Cabin'] = le.fit_transform(df['Cabin']) # proses encoding

#Label encoding digunakan untuk mengubah nilai-nilai dalam kolom kategori (categorical) menjadi bilangan bulat (integer) agar bisa digunakan dalam berbagai algoritma machine learning yang memerlukan input berupa bilangan bulat

In [7]:
#Langkah 4 - Verifikasi Hasil
df.head() #menampilkan beberapa data teratasa dari data frame

   Survived  Pclass   Age  Sex  Cabin
0         0       3  22.0    1    115
1         1       1  38.0    0     81
2         1       3  26.0    0    115
3         1       1  35.0    0     55
4         0       3  35.0    1    115

In [9]:
#Langkah 5 - Standarisasi
std = StandardScaler() #menciptakan sebuah objek dari kelas StandardScaler yang akan digunakan untuk melakukan standarisasi.
df['Age'] = std.fit_transform(df[['Age']]) #mengambil kolom age untuk mengubah nilai dari kolom age menjadinilai yg telah distandarisasi.
#Standarisasi dalam hal ini mengubah nilai-nilai dalam kolom tersebut sehingga memiliki rata-rata 0 dan deviasi standar 1. Hasil standarisasi kemudian disimpan kembali dalam kolom 'Age' dalam DataFrame df.

In [10]:
#Langkah 6 - Verifikasi Hasil Standarisasi
df.head() #menampilkan beberapa data teratas dari data frame

   Survived  Pclass       Age  Sex  Cabin
0         0       3 -0.592481    1    115
1         1       1  0.638789    0     81
2         1       3 -0.284663    0    115
3         1       1  0.407926    0     55
4         0       3  0.407926    1    115